#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.single_zone.data.archive_file.warmer_function[0]: Reading...
module.single_zone.data.archive_file.revalidation_function[0]: Reading...
module.single_zone.data.archive_file.image_optimisation_function[0]: Reading...
module.single_zone.data.archive_file.revalidation_function[0]: Read complete after 0s [id=30e0a70b532cb71cbe7b6407ee9af96636c14b5e]
module.single_zone.data.archive_file.warmer_function[0]: Read complete after 0s [id=d23f23716669cf428787c62a15356e732cd08960]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Reading...
module.single_zone.module.public_resources[0].aws_cloudfront_function.x_forwarded_host: Refreshing state... [id=vltech-website-x-forwarded-host-function]
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Reading...
module.single_zone.module.public_resources[0].data.aws_region.current: Reading...
module.single_zone.module.public_resources[0].aws_cloudfront_origin_access_control.website_origin_access_control: Refreshing state... [id=E3RNQ0V4MAIQ68]
module.single_zone.module.public_resources[0].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.single_zone.module.public_resources[0].aws_cloudfront_cache_policy.cache_policy[0]: Refreshing state... [id=06efa7e0-f0db-4669-832e-5b76036eb9b1]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Read complete after 0s [id=b689b0a8-53d0-40ab-baf2-68738e2966ac]
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_caller_identity.current: Reading...
module.single_zone.data.aws_region.current: Reading...
module.single_zone.module.server_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-server-function]
module.single_zone.module.server_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-server-function-role]
module.single_zone.module.server_function.data.aws_caller_identity.current: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Reading...
module.single_zone.aws_sqs_queue.revalidation_queue: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/615299762949/vltech-website-isr-queue.fifo]
module.single_zone.aws_s3_bucket.bucket[0]: Refreshing state... [id=vltech-website-website-bucket]
module.single_zone.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.aws_dynamodb_table.isr_table[0]: Refreshing state... [id=vltech-website-isr-tag-mapping]
data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Reading...
module.single_zone.module.image_optimisation_function[0].aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-image-optimization-function]
module.single_zone.module.server_function.data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.revalidation_function.data.aws_region.current: Reading...
module.single_zone.module.revalidation_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.image_optimisation_function[0].aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-image-optimization-function-role]
module.single_zone.data.archive_file.image_optimisation_function[0]: Read complete after 1s [id=128a8a9f124a4e257bc0db968e346a73ae676e73]
module.single_zone.module.revalidation_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-revalidation-function-role]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.open_next_aliases[0].aws_ssm_parameter.origin_aliases: Refreshing state... [id=vltech-website-website-origin-aliases]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Read complete after 0s [id=Z01305181G23H04WP32YA]
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.server_function.data.aws_region.current: Reading...
module.single_zone.module.server_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.revalidation_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-revalidation-function]
module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-revalidation-function]
module.single_zone.module.revalidation_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-revalidation-function-lambda-policy]
module.single_zone.module.revalidation_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-revalidation-function-role-20241218205629363600000001]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Reading...
module.single_zone.module.revalidation_function.aws_lambda_alias.lambda_alias["stable"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:stable]
module.single_zone.aws_lambda_event_source_mapping.revalidation_queue_source: Refreshing state... [id=23604771-f7d2-432b-ba67-c4d45c3c7817]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Read complete after 0s [id=vltech-website-website-origin-aliases]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/apple-icon.png/layout"]: Refreshing state... [id=cb0411ad-aae3-24cb-5558-7ad70d01626c]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/favicon.ico/route"]: Refreshing state... [id=238dae81-6d89-bd29-4650-9ba5c757042c]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/favicon.ico"]: Refreshing state... [id=f506986f-81e3-bae5-a0d7-07494d98d216]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/icon.svg"]: Refreshing state... [id=642905ef-3839-e197-5492-660776c10a7d]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/page"]: Refreshing state... [id=aaf89061-1fe4-964f-2985-56777fd78bc5]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/"]: Refreshing state... [id=fda35a67-c858-dab4-99f6-467df555c64a]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/icon.svg/layout"]: Refreshing state... [id=91fced8f-f8e1-3e4a-471a-bea2a465f1eb]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/apple-icon.png/route"]: Refreshing state... [id=2ff4eaa3-34bc-3e0a-c5b4-1a86088c54d5]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/index"]: Refreshing state... [id=2b5629ae-c9f1-8e73-259f-5cbf840eab28]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/icon.svg"]: Refreshing state... [id=ccc0252a-fec1-c890-2309-673334440b2f]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/favicon.ico"]: Refreshing state... [id=21d05db2-d842-090a-8a9c-ff120d0321e8]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/_not-found"]: Refreshing state... [id=f70be1cc-7b44-37e1-0462-0dc0d4361f73]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/favicon.ico/layout"]: Refreshing state... [id=adf98f7e-441c-1319-237b-5d8d242c6917]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/_not-found/page"]: Refreshing state... [id=ec10ba77-a553-86d5-e146-ff6637ba35a8]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/_not-found/layout"]: Refreshing state... [id=b7158bdd-9682-52cb-4def-875cf402ed92]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/_not-found"]: Refreshing state... [id=1eb8cee9-990e-9eec-3140-10e009c563e7]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/apple-icon.png"]: Refreshing state... [id=cbc6f888-3c80-465e-ae6b-380cad9891c5]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/apple-icon.png"]: Refreshing state... [id=a3c80496-f3b8-d09a-e5bd-db3a166cd26d]
module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/icon.svg/route"]: Refreshing state... [id=d0fef283-18c3-1fbd-895d-be57b78130c7]
module.single_zone.module.revalidation_function.terraform_data.update_alias[0]: Refreshing state... [id=1fa6a9da-0900-6ece-7f69-93e3a7c00a2c]
module.single_zone.module.revalidation_function.aws_lambda_function_url.function_url["stable"]: Refreshing state... [id=vltech-website-revalidation-function/stable]
module.single_zone.module.image_optimisation_function[0].aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-image-optimization-function-lambda-policy]
module.single_zone.module.server_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-server-function-lambda-policy]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-image-optimization-function]
module.single_zone.data.archive_file.server_function[0]: Reading...
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_error-9b7125ad1a1e68fa.js"]: Refreshing state... [id=75ef6842-85f2-603c-3c4b-cd67c9b9561f]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_app-d23763e3e6c904ff.js"]: Refreshing state... [id=a0a95740-9bd1-bbc5-3088-e6e5d18fff57]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/c740c1d45290834f-s.woff2"]: Refreshing state... [id=6c695a5c-d238-b55a-e737-abff99fcd32c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/357398c3a461852b-s.woff2"]: Refreshing state... [id=e42276e7-9c0c-c131-fdcf-2a5abf5f7666]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/framework-a6eb4bce5bd8ed9b.js"]: Refreshing state... [id=2e38b1f6-e9cc-8645-2869-3d55b50564e3]
module.single_zone.module.s3_assets.terraform_data.file_sync["Ce_V2TiWHeu_C7bKL-B9T/_not-found.cache"]: Refreshing state... [id=b73671ba-b909-e0e4-83c8-74c62c053cba]
module.single_zone.module.s3_assets.terraform_data.file_sync["file.svg"]: Refreshing state... [id=40d7329f-d154-8a03-5823-f80355a6142d]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/2eeaa02267ae05a4.css"]: Refreshing state... [id=d53b2b03-50fc-268b-bc75-31068c325b1e]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/7bafef50a4560c1d-s.woff2"]: Refreshing state... [id=271e32ae-abf0-ca24-a29d-49260817d15a]
module.single_zone.module.s3_assets.terraform_data.file_sync["globe.svg"]: Refreshing state... [id=60f4e56a-aabf-7501-3c3e-274d6c09a951]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/42aa6e6ea3b85651-s.woff2"]: Refreshing state... [id=59d3c0ee-ae3d-7390-a731-81f5168d647a]
module.single_zone.module.s3_assets.terraform_data.file_sync["vercel.svg"]: Refreshing state... [id=bb14bb5d-dde9-bd1c-a554-c16a0cd13e4f]
module.single_zone.module.s3_assets.terraform_data.file_sync["next.svg"]: Refreshing state... [id=3a4c6e17-f8b6-1aa9-347a-25702f8ea170]
module.single_zone.module.s3_assets.terraform_data.file_sync["Ce_V2TiWHeu_C7bKL-B9T/index.cache"]: Refreshing state... [id=b2b7811d-19ee-4844-bdbd-aa0fa5150db3]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/bc270b3a577192a7-s.woff2"]: Refreshing state... [id=16b8f0c3-94b5-168f-1fc9-f51adc0e8a3c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9f05b6a2725a7318-s.woff2"]: Refreshing state... [id=ac4a618e-66ed-1415-d02d-9d88a4c281ad]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/b32bc20a1e277f31-s.woff2"]: Refreshing state... [id=321d4549-ae06-3830-42eb-cfce7a6e73cf]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/polyfills-42372ed130431b0a.js"]: Refreshing state... [id=83abb4c2-13d6-9782-a9c9-1f886e23d3a1]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/_not-found/page-0043d75de3bc49f5.js"]: Refreshing state... [id=431c59dc-b990-f5cf-efc4-d2777821eb00]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-409a65f7ee0c9b64.js"]: Refreshing state... [id=918a66e4-812e-ff45-0beb-4b59ddfc7461]
module.single_zone.module.s3_assets.terraform_data.file_sync["Ce_V2TiWHeu_C7bKL-B9T/apple-icon.png.cache"]: Refreshing state... [id=82b3e68f-33ee-4315-b456-2317e7160402]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/a8eac78432f0a60b-s.woff2"]: Refreshing state... [id=9e031051-5705-f03c-c644-4ca8b9261bf5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/Ce_V2TiWHeu_C7bKL-B9T/_buildManifest.js"]: Refreshing state... [id=7f8976fa-6421-e1dd-0bd5-f4f8f5b3935e]
module.single_zone.module.s3_assets.terraform_data.file_sync["favicon.ico"]: Refreshing state... [id=d538d61d-dce0-cc44-df24-44711711892d]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9bbb7f84f3601865-s.woff2"]: Refreshing state... [id=325d0d9e-b078-18a5-55c7-a53c90d5c6d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-app-995b1460810ee5b7.js"]: Refreshing state... [id=6758fc44-e54a-99cd-b093-0e0dbafbfffd]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/4d1af68a2715a16a-s.p.woff2"]: Refreshing state... [id=e72e9c33-e3f8-1fde-1eb0-6a73205452e8]
module.single_zone.module.s3_assets.terraform_data.file_sync["window.svg"]: Refreshing state... [id=fea322f0-2d5a-7fbf-f75b-15a781be5d23]
module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"]: Refreshing state... [id=7efec957-a664-84b6-02cd-812c22d79de5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/382b6f43e60580be-s.woff2"]: Refreshing state... [id=02cd3ae0-21e8-4118-e990-2aebe2360167]
module.single_zone.module.s3_assets.terraform_data.file_sync["Ce_V2TiWHeu_C7bKL-B9T/icon.svg.cache"]: Refreshing state... [id=d6738886-a3aa-c75d-3816-4ff2a4fb8315]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/4bd1b696-095a8791bedde78b.js"]: Refreshing state... [id=396675ca-1f30-d993-ebe9-c97c2f3fec71]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-1852367c91c26582.js"]: Refreshing state... [id=9572b7d9-d12a-8a49-1db6-5a6476060cce]
module.single_zone.module.s3_assets.terraform_data.file_sync["Ce_V2TiWHeu_C7bKL-B9T/500.cache"]: Refreshing state... [id=24ba7468-fb63-0d8c-b4b2-607e00f666d2]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-8afb5c88d2340613.js"]: Refreshing state... [id=466372c9-168c-2f72-f31f-51cac8590e83]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/9d4aa2bb10d1d993.css"]: Refreshing state... [id=b1d255f7-1fe7-67be-6085-37a0f528d327]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-4007705705dbde3d.js"]: Refreshing state... [id=5e5e3e29-d3e6-a563-dca9-fd8f2a5d781a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/122c360d7fe6d395-s.p.woff2"]: Refreshing state... [id=674ad872-ee9b-89bd-9252-351607ab6caf]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-a94dc7d5be27de7f.js"]: Refreshing state... [id=cdc4d050-12ee-266a-f644-db6ef1fdc14a]
module.single_zone.module.s3_assets.terraform_data.file_sync["Ce_V2TiWHeu_C7bKL-B9T/favicon.ico.cache"]: Refreshing state... [id=52e149fb-75d1-ec1b-cd81-51c72cd5ec97]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/d0697bdd3fb49a78-s.woff2"]: Refreshing state... [id=9076105b-745e-e65e-ec39-f64e126aac2e]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/Ce_V2TiWHeu_C7bKL-B9T/_ssgManifest.js"]: Refreshing state... [id=75423372-19cc-4a57-00d1-dfc0e1edbdf7]
module.single_zone.module.image_optimisation_function[0].aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-image-optimization-function-role-20241218205750570200000002]
module.single_zone.module.server_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-server-function-role-20241218205750451600000001]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:nextjs]
module.single_zone.module.image_optimisation_function[0].aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205755531800000003]
module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0]: Refreshing state... [id=41197b03-bbee-dabb-3662-ea3d80e90e64]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-image-optimization-function/nextjs]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-image-optimization-function/opennext]
module.single_zone.data.archive_file.server_function[0]: Read complete after 2s [id=a28e620200a3b7fa080ae02351ff6357c01e2a22]
module.single_zone.module.server_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-server-function]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:opennext]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:nextjs]
module.single_zone.module.server_function.aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205803707400000004]
module.single_zone.module.server_function.terraform_data.update_alias[0]: Refreshing state... [id=33a53fdf-a76d-0315-9880-485eb54f1aca]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-server-function/nextjs]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-server-function/opennext]
module.single_zone.module.public_resources[0].aws_cloudfront_distribution.production_distribution[0]: Refreshing state... [id=EU3DKQFOTEI79]
module.single_zone.module.public_resources[0].aws_route53_record.route53_aaaa_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_victorlevasseur.tech_AAAA]
module.single_zone.module.public_resources[0].aws_route53_record.route53_a_record["www_victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_A]
module.single_zone.module.public_resources[0].aws_route53_record.route53_a_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_victorlevasseur.tech_A]
module.single_zone.module.public_resources[0].aws_route53_record.route53_aaaa_record["www_victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_AAAA]
module.single_zone.terraform_data.update_aliases[0]: Refreshing state... [id=8e6f8263-8630-25c2-0c84-e5d0692e9c55]
module.single_zone.aws_s3_bucket_policy.bucket_policy[0]: Refreshing state... [id=vltech-website-website-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "fda35a67-c858-dab4-99f6-467df555c64a" -> null
      - triggers_replace = [
          - "nextjs",
          - "2bd2044a315a85ece6b52e4380e2899a",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/_not-found"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "1eb8cee9-990e-9eec-3140-10e009c563e7" -> null
      - triggers_replace = [
          - "nextjs",
          - "49d5a8efa7fbceafc012ee1518e7ed7e",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/_not-found/layout"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/_not-found/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b7158bdd-9682-52cb-4def-875cf402ed92" -> null
      - triggers_replace = [
          - "nextjs",
          - "06c9540ee44c4cc9d4691fc527010dca",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/_not-found/page"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/_not-found/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "ec10ba77-a553-86d5-e146-ff6637ba35a8" -> null
      - triggers_replace = [
          - "nextjs",
          - "271f85536a44063e9090d6afcaa05e77",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/apple-icon.png"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "cbc6f888-3c80-465e-ae6b-380cad9891c5" -> null
      - triggers_replace = [
          - "nextjs",
          - "df9d698ccc7c514b5e72b95b508507b8",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/apple-icon.png/layout"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/apple-icon.png/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "cb0411ad-aae3-24cb-5558-7ad70d01626c" -> null
      - triggers_replace = [
          - "nextjs",
          - "baa7f481f7f30888afaff76f22163c31",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/apple-icon.png/route"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/apple-icon.png/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "2ff4eaa3-34bc-3e0a-c5b4-1a86088c54d5" -> null
      - triggers_replace = [
          - "nextjs",
          - "cfbb2feb154137d24ca80b6b1c104a13",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/favicon.ico"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "f506986f-81e3-bae5-a0d7-07494d98d216" -> null
      - triggers_replace = [
          - "nextjs",
          - "f438226e00bf7afa6c3f22c27a969359",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/favicon.ico/layout"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/favicon.ico/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "adf98f7e-441c-1319-237b-5d8d242c6917" -> null
      - triggers_replace = [
          - "nextjs",
          - "9eca74fb366bf56d6fbb1d4af739881b",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/favicon.ico/route"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/favicon.ico/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "238dae81-6d89-bd29-4650-9ba5c757042c" -> null
      - triggers_replace = [
          - "nextjs",
          - "a510c23f6b2e6beb71368dbda04da1c0",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/icon.svg"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "ccc0252a-fec1-c890-2309-673334440b2f" -> null
      - triggers_replace = [
          - "nextjs",
          - "b6e72c29b213cbde2ab2a809ac174909",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/icon.svg/layout"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/icon.svg/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "91fced8f-f8e1-3e4a-471a-bea2a465f1eb" -> null
      - triggers_replace = [
          - "nextjs",
          - "69de6ab7cfbf07d53fbfe50e7dbbae9d",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/icon.svg/route"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/icon.svg/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "d0fef283-18c3-1fbd-895d-be57b78130c7" -> null
      - triggers_replace = [
          - "nextjs",
          - "544dc1d11d37dbc069aafd4c743a377e",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/_not-found"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "f70be1cc-7b44-37e1-0462-0dc0d4361f73" -> null
      - triggers_replace = [
          - "nextjs",
          - "3bc0b42ee3b651e70f8e46c084d23762",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/apple-icon.png"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "a3c80496-f3b8-d09a-e5bd-db3a166cd26d" -> null
      - triggers_replace = [
          - "nextjs",
          - "2db8b2231ebca8f08d9072e4d8682865",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/favicon.ico"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "21d05db2-d842-090a-8a9c-ff120d0321e8" -> null
      - triggers_replace = [
          - "nextjs",
          - "cdf0ffc194a3fde10de6290a11e8ff89",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/icon.svg"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "642905ef-3839-e197-5492-660776c10a7d" -> null
      - triggers_replace = [
          - "nextjs",
          - "2627c0ef4ae5db058acbe4c76a36df31",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/index"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/layout-Ce_V2TiWHeu_C7bKL-B9T/index"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "2b5629ae-c9f1-8e73-259f-5cbf840eab28" -> null
      - triggers_replace = [
          - "nextjs",
          - "04778aed0348f85b55274d2257df6928",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/page"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_N_T_/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "aaf89061-1fe4-964f-2985-56777fd78bc5" -> null
      - triggers_replace = [
          - "nextjs",
          - "1b81afec88f3e9ce5906afee4bf685e3",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["Sjq4P9iCNYDhjD2KOlakE/_N_T_/"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "fe8ce51ba1b216cd9b1cdcf53257ebf7",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["Sjq4P9iCNYDhjD2KOlakE/_N_T_/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "fe9f1756e3e93208328e8577592b2079",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["Sjq4P9iCNYDhjD2KOlakE/_N_T_/_not-found/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "6b49efaf8b1a637e7bb4c12ceafebdc4",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["Sjq4P9iCNYDhjD2KOlakE/_N_T_/_not-found/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "09dff8829e9b9d383bb607d926a2af46",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["Sjq4P9iCNYDhjD2KOlakE/_N_T_/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "0c4428ea3e5d8c2f00793173276cd275",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["Sjq4P9iCNYDhjD2KOlakE/_N_T_/favicon.ico/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "6528e778212406e9a2eed01163ca96e9",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["Sjq4P9iCNYDhjD2KOlakE/_N_T_/favicon.ico/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "311d47f7832627da4733a8801964fdf0",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["Sjq4P9iCNYDhjD2KOlakE/_N_T_/layout-Sjq4P9iCNYDhjD2KOlakE/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "7e9e01c0025243b5b43cc49353c42bd6",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["Sjq4P9iCNYDhjD2KOlakE/_N_T_/layout-Sjq4P9iCNYDhjD2KOlakE/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "c00b36d400801931c5342885755c7625",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["Sjq4P9iCNYDhjD2KOlakE/_N_T_/layout-Sjq4P9iCNYDhjD2KOlakE/index"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "42777e8aaf8f63167da223d4f6bd7845",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["Sjq4P9iCNYDhjD2KOlakE/_N_T_/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "743a334427d5d1fbc46661fb65fbb2b9",
        ]
    }

  # module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-image-optimization-function"
      ~ last_modified                  = "2025-02-11T16:13:50.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:6/invocations" -> (known after apply)
      ~ source_code_hash               = "0Br8UUInkF4fETcohwkLl5+v7u69X2l6jKUwlpR+5aQ=" -> "1H1R4knaxtftUGOdHvj4KhdIna5evoESpHv4kHUD1AA="
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "41197b03-bbee-dabb-3662-ea3d80e90e64" -> (known after apply)
      ~ triggers_replace = [
          ~ "6" -> (known after apply),
            "nextjs",
        ]
    }

  # module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-revalidation-function"
      ~ last_modified                  = "2025-02-11T16:13:42.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:6/invocations" -> (known after apply)
      ~ source_code_hash               = "eeY2wsvgE8ylDQ5zG7OSwtgE2q040NRhJKB8ghIPa7s=" -> "jdq2HJ25A0YMXwm0GLCBB/SCWyvNiAtzIwqxlo8f2k8="
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.single_zone.module.revalidation_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "1fa6a9da-0900-6ece-7f69-93e3a7c00a2c" -> (known after apply)
      ~ triggers_replace = [
          ~ "6" -> (known after apply),
            "stable",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"] must be replaced
-/+ resource "terraform_data" "file_sync" {
      ~ id               = "7efec957-a664-84b6-02cd-812c22d79de5" -> (known after apply)
      ~ triggers_replace = [
            # (1 unchanged element hidden)
            "nextjs",
          ~ "dcece9b1853d31ffc3a1f8b32d9d694f" -> "d0dda5066c41c7e59ec773307fb885c7",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["Ce_V2TiWHeu_C7bKL-B9T/500.cache"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/500.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "24ba7468-fb63-0d8c-b4b2-607e00f666d2" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "a4d641d4d0b995ce3c097291d8cbd805",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["Ce_V2TiWHeu_C7bKL-B9T/_not-found.cache"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/_not-found.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "b73671ba-b909-e0e4-83c8-74c62c053cba" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "26664b124d67392ee2e06dfc71ad63d1",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["Ce_V2TiWHeu_C7bKL-B9T/apple-icon.png.cache"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/apple-icon.png.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "82b3e68f-33ee-4315-b456-2317e7160402" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9843a61c98627e227286769373becd10",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["Ce_V2TiWHeu_C7bKL-B9T/favicon.ico.cache"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/favicon.ico.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "52e149fb-75d1-ec1b-cd81-51c72cd5ec97" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "1253a11e7fded511c766a255028ab4ee",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["Ce_V2TiWHeu_C7bKL-B9T/icon.svg.cache"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/icon.svg.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "d6738886-a3aa-c75d-3816-4ff2a4fb8315" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "31e8b96a370a0c0409d732d5d9c1d2d6",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["Ce_V2TiWHeu_C7bKL-B9T/index.cache"] will be destroyed
  # (because key ["Ce_V2TiWHeu_C7bKL-B9T/index.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "b2b7811d-19ee-4844-bdbd-aa0fa5150db3" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "4a6619db691aaa9c1c8ceae1b8595489",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["Sjq4P9iCNYDhjD2KOlakE/500.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "d072fce9f117a5a6c4d8db4f86604578",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["Sjq4P9iCNYDhjD2KOlakE/_not-found.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9ce91370f5d0e6a2f3a2a2ab51ab5ae1",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["Sjq4P9iCNYDhjD2KOlakE/favicon.ico.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "6dee9fdaf9e8204bac3f1fed87c6e6f2",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["Sjq4P9iCNYDhjD2KOlakE/index.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "cb50d2cac474ea9a083b32ae260c8159",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/Ce_V2TiWHeu_C7bKL-B9T/_buildManifest.js"] will be destroyed
  # (because key ["_next/static/Ce_V2TiWHeu_C7bKL-B9T/_buildManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "7f8976fa-6421-e1dd-0bd5-f4f8f5b3935e" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "fff71830625cbfb6e0e1cb09d106075f",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/Ce_V2TiWHeu_C7bKL-B9T/_ssgManifest.js"] will be destroyed
  # (because key ["_next/static/Ce_V2TiWHeu_C7bKL-B9T/_ssgManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "75423372-19cc-4a57-00d1-dfc0e1edbdf7" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "b404e23d62d95bafd03ad7747cc0e88b",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/Sjq4P9iCNYDhjD2KOlakE/_buildManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "029e52661382cc31d0037ab9155acd1c",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/Sjq4P9iCNYDhjD2KOlakE/_ssgManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "b404e23d62d95bafd03ad7747cc0e88b",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-0520bb4f4c7382a3.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "b35ea13399eb43260f506c56a2165f12",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-4007705705dbde3d.js"] will be destroyed
  # (because key ["_next/static/chunks/517-4007705705dbde3d.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "5e5e3e29-d3e6-a563-dca9-fd8f2a5d781a" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "af329f2997a3595ccfaa778e4ae0e1e3",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-a94dc7d5be27de7f.js"] will be destroyed
  # (because key ["_next/static/chunks/app/layout-a94dc7d5be27de7f.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "cdc4d050-12ee-266a-f644-db6ef1fdc14a" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9c1b29ec041c9b04ef7234a59503069a",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-e498c924e3398837.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "409dc8d2d2da8f27d2a931da8e5e6449",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-409a65f7ee0c9b64.js"] will be destroyed
  # (because key ["_next/static/chunks/app/page-409a65f7ee0c9b64.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "918a66e4-812e-ff45-0beb-4b59ddfc7461" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "27c0be3d35007cd4089211f79353b81b",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-61ad87b40dfeb6fa.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "694c97fc98898fb630c20ae1f141c871",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-8afb5c88d2340613.js"] will be destroyed
  # (because key ["_next/static/chunks/main-8afb5c88d2340613.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "466372c9-168c-2f72-f31f-51cac8590e83" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9b47557762af296d2db93e5a0b46e0b4",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-app-995b1460810ee5b7.js"] will be destroyed
  # (because key ["_next/static/chunks/main-app-995b1460810ee5b7.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "6758fc44-e54a-99cd-b093-0e0dbafbfffd" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "ca80b4c8a4a1e544840e988b8888773b",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-app-d4c84837250c81b8.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "f99e4b8740c6c2d2273cdf1470ba9ff9",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-e3a7a26d77bf0f33.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "54ecca75e7222792f28ccfed898fce72",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-1852367c91c26582.js"] will be destroyed
  # (because key ["_next/static/chunks/webpack-1852367c91c26582.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "9572b7d9-d12a-8a49-1db6-5a6476060cce" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "8641eab1e323a7d755e508c94ecfa07c",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-1a0a2cb4f9fabdfe.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "5a4436fb43cc8eb1a53f3f850f29136d",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/2eeaa02267ae05a4.css"] will be destroyed
  # (because key ["_next/static/css/2eeaa02267ae05a4.css"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "d53b2b03-50fc-268b-bc75-31068c325b1e" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9a2fdf37ef6deab0b60b6244048b0e96",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/54289831f6f24f37.css"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "fe02bec6ea9ec56afbae7d081364384a",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/76ee27c717be5ff9.css"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "547f0cec1904ed34ccf58e6b9cbdf3cf",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/9d4aa2bb10d1d993.css"] will be destroyed
  # (because key ["_next/static/css/9d4aa2bb10d1d993.css"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "b1d255f7-1fe7-67be-6085-37a0f528d327" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "670780e58785b8df12143d006ebe78bd",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["favicon.ico"] must be replaced
-/+ resource "terraform_data" "file_sync" {
      ~ id               = "d538d61d-dce0-cc44-df24-44711711892d" -> (known after apply)
      ~ triggers_replace = [
            # (1 unchanged element hidden)
            "nextjs",
          ~ "cc00f3e459951f3d4f33fcda7f6cee5f" -> "c30c7d42707a47a3f4591831641e50dc",
        ]
    }

  # module.single_zone.module.server_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-server-function"
      ~ last_modified                  = "2025-02-11T16:13:58.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:6/invocations" -> (known after apply)
      ~ source_code_hash               = "CCvf6cETBwGN6yU5k8JVM7JMYXN1sUxZSjwC4F2r6SA=" -> "yXhgp1aEM2XY+3vdniYpnJ13Te2vcL+O+nEjEsBbsXM="
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.server_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "33a53fdf-a76d-0315-9880-485eb54f1aca" -> (known after apply)
      ~ triggers_replace = [
          ~ "6" -> (known after apply),
            "nextjs",
        ]
    }

Plan: 30 to add, 3 to change, 40 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dependabot[bot], Action: `pull_request`, Working Directory: `terraform`, Workflow: `PR Checks`*